# Grouping and Aggregation in pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    'Department': ['HR', 'Finance', 'IT', 'HR', 'IT', 'Finance', 'HR'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank', 'Grace'],
    'Salary': [5000, 6000, 7000, 5200, 7500, 6400, 5500],
    'Experience': [3, 4, 5, 2, 6, 5, 3]
}

df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         HR    Alice    5000           3
1    Finance      Bob    6000           4
2         IT  Charlie    7000           5
3         HR    David    5200           2
4         IT      Eve    7500           6
5    Finance    Frank    6400           5
6         HR    Grace    5500           3

In [3]:
#groupping
grouped_df = df.groupby("Department")
grouped_df

In [4]:
grouped_df.sum()

                   Employee  Salary  Experience
Department
Finance            BobFrank   12400           9
HR          AliceDavidGrace   15700           8
IT               CharlieEve   14500          11

In [5]:
grouped_df.max()

           Employee  Salary  Experience
Department
Finance       Frank    6400           5
HR            Grace    5500           3
IT              Eve    7500           6

In [6]:
grouped_df["Salary"]

In [8]:
grouped_df["Salary"].sum()

Department
Finance    12400
HR         15700
IT         14500
Name: Salary, dtype: int64

In [7]:
grouped_df[["Salary"]]

In [9]:
grouped_df["Experience"].min()

Department
Finance    4
HR         2
IT         5
Name: Experience, dtype: int64

In [12]:
grouped_df.agg({
    "Salary": ["sum", "mean", "std", "var"],
    "Experience": ["min", "max"]    
})

           Salary                                         Experience
              sum         mean         std            var        min max
Department
Finance     12400  6200.000000  282.842712   80000.000000          4   5
HR          15700  5233.333333  251.661148   63333.333333          2   3
IT          14500  7250.000000  353.553391  125000.000000          5   6

In [13]:
def cal_range(series):
    return series.max() - series.min()
grouped_df["Salary"].agg(cal_range)

Department
Finance    400
HR         500
IT         500
Name: Salary, dtype: int64

In [14]:
grouped_df.agg({
    "Salary": ["sum", "mean", "std", "var", cal_range],
    "Experience": ["min", "max"]    
})

           Salary                                                    \
              sum         mean         std            var cal_range
Department
Finance     12400  6200.000000  282.842712   80000.000000       400
HR          15700  5233.333333  251.661148   63333.333333       500
IT          14500  7250.000000  353.553391  125000.000000       500

           Experience
                  min max
Department
Finance             4   5
HR                  2   3
IT                  5   6

In [15]:
grouped_df.filter(lambda x: len(x)>2)

  Department Employee  Salary  Experience
0         HR    Alice    5000           3
3         HR    David    5200           2
6         HR    Grace    5500           3

In [16]:
df["Salary Expanded"]=df["Salary"].expanding().sum()
df

  Department Employee  Salary  Experience  Salary Expanded
0         HR    Alice    5000           3           5000.0
1    Finance      Bob    6000           4          11000.0
2         IT  Charlie    7000           5          18000.0
3         HR    David    5200           2          23200.0
4         IT      Eve    7500           6          30700.0
5    Finance    Frank    6400           5          37100.0
6         HR    Grace    5500           3          42600.0

In [18]:
#pivot table
df.pivot_table(index="Department", values="Salary", columns="Experience")

Experience       2       3       4       5       6
Department
Finance        NaN     NaN  6000.0  6400.0     NaN
HR          5200.0  5250.0     NaN     NaN     NaN
IT             NaN     NaN     NaN  7000.0  7500.0

In [17]:
#pivot table
df.pivot_table(index="Department", values="Salary", columns="Experience", aggfunc="min")

Experience       2       3       4       5       6
Department
Finance        NaN     NaN  6000.0  6400.0     NaN
HR          5200.0  5000.0     NaN     NaN     NaN
IT             NaN     NaN     NaN  7000.0  7500.0